perf/results/intensivo/gunicorn_1/gunicorn_intensivo_1.log

> perf@1.0.0 artillery /Users/mmariotti/Documents/UBA/1c20-tp-1/perf
> artillery "run" "intensivo.yaml" "-e" "gunicorn"

Started phase 0 (Warm Up), duration: 30s @ 14:00:59(-0300) 2020-05-17
Report @ 14:01:09(-0300) 2020-05-17
Elapsed time: 10 seconds
  Scenarios launched:  49
  Scenarios completed: 19
  Requests completed:  19
  Mean response/sec: 5.02
  Response time (msec):
    min: 508.8
    max: 5959.9
    median: 3247.2
    p95: 5824.3
    p99: 5959.9
  Codes:
    200: 19

Report @ 14:01:19(-0300) 2020-05-17
Elapsed time: 20 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5.01
  Response time (msec):
    min: 6260.2
    max: 11981.9
    median: 9121
    p95: 11830.4
    p99: 11981.9
  Codes:
    200: 20

Report @ 14:01:29(-0300) 2020-05-17
Elapsed time: 30 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5
  Response time (msec):
    min: 12282.8
    max: 18013.1
    median: 15148.3
    p95: 17862.4
    p99: 18013.1
  Codes:
    200: 20

Started phase 1 (Linear Ramp), duration: 80s @ 14:01:29(-0300) 2020-05-17
Report @ 14:01:39(-0300) 2020-05-17
Elapsed time: 40 seconds
  Scenarios launched:  57
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5.71
  Response time (msec):
    min: 18314.3
    max: 24034.7
    median: 21174.7
    p95: 23884
    p99: 24034.7
  Codes:
    200: 20

Report @ 14:01:49(-0300) 2020-05-17
Elapsed time: 50 seconds
  Scenarios launched:  136
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 13.91
  Response time (msec):
    min: 24335.6
    max: 30060.8
    median: 27198.4
    p95: 29910
    p99: 30060.8
  Codes:
    200: 20

Report @ 14:01:59(-0300) 2020-05-17
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  187
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 18.78
  Response time (msec):
    min: 30361.2
    max: 36086.5
    median: 33225.2
    p95: 35936.3
    p99: 36086.5
  Codes:
    200: 20

Report @ 14:02:09(-0300) 2020-05-17
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  246
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 24.67
  Response time (msec):
    min: 36388
    max: 42116.3
    median: 39252.3
    p95: 41965.7
    p99: 42116.3
  Codes:
    200: 20
  Errors:
    ECONNRESET: 125

Report @ 14:02:19(-0300) 2020-05-17
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  304
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 30.4
  Response time (msec):
    min: 42416.5
    max: 47017.2
    median: 45167.8
    p95: 46915.9
    p99: 47017.2
  Codes:
    200: 20
  Errors:
    ECONNRESET: 284

Report @ 14:02:29(-0300) 2020-05-17
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  366
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 36.6
  Response time (msec):
    min: 47318.9
    max: 52600.9
    median: 49831.1
    p95: 52591.3
    p99: 52600.9
  Codes:
    200: 20
  Errors:
    ECONNRESET: 346

Report @ 14:02:39(-0300) 2020-05-17
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  415
  Scenarios completed: 27
  Requests completed:  27
  Mean response/sec: 41.58
  Response time (msec):
    min: 52962.6
    max: 60009.4
    median: 58241.3
    p95: 60006.8
    p99: 60009.4
  Codes:
    200: 17
    504: 10
  Errors:
    ECONNRESET: 388

Report @ 14:02:49(-0300) 2020-05-17
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  483
  Scenarios completed: 119
  Requests completed:  119
  Mean response/sec: 48.3
  Response time (msec):
    min: 60002.8
    max: 63115.5
    median: 60005.2
    p95: 61035
    p99: 63076.7
  Codes:
    504: 119
  Errors:
    ECONNRESET: 365

Started phase 2 (High Plain), duration: 30s @ 14:02:49(-0300) 2020-05-17
Report @ 14:02:59(-0300) 2020-05-17
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  499
  Scenarios completed: 174
  Requests completed:  174
  Mean response/sec: 49.9
  Response time (msec):
    min: 60003.7
    max: 67111.7
    median: 60005.2
    p95: 61059.6
    p99: 67106.7
  Codes:
    504: 174
  Errors:
    ECONNRESET: 324

Warning: 
CPU usage of Artillery seems to be very high (pids: 33953)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 14:03:09(-0300) 2020-05-17
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  500
  Scenarios completed: 108
  Requests completed:  108
  Mean response/sec: 50
  Response time (msec):
    min: 20704.9
    max: 84586.8
    median: 60005.9
    p95: 67120.8
    p99: 84482.1
  Codes:
    502: 3
    504: 105
  Errors:
    ECONNRESET: 392

Report @ 14:03:19(-0300) 2020-05-17
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  500
  Scenarios completed: 79
  Requests completed:  79
  Mean response/sec: 50
  Response time (msec):
    min: 14287.4
    max: 92010.5
    median: 68202.9
    p95: 91957.7
    p99: 92008.8
  Codes:
    502: 19
    504: 60
  Errors:
    ECONNRESET: 421

Warning: High CPU usage warning (pids: 33953).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Started phase 3 (Pause), duration: undefineds @ 14:03:19(-0300) 2020-05-17
Report @ 14:03:29(-0300) 2020-05-17
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  3
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.3
  Response time (msec):
    min: 60004.1
    max: 60008.3
    median: 60005.6
    p95: 60007.6
    p99: 60008.3
  Codes:
    504: 20
  Errors:
    ECONNRESET: 3

Report @ 14:03:39(-0300) 2020-05-17
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 27
  Requests completed:  27
  Mean response/sec: NaN
  Response time (msec):
    min: 60003.9
    max: 60010.9
    median: 60006.2
    p95: 60008.6
    p99: 60010.9
  Codes:
    504: 27

Report @ 14:03:49(-0300) 2020-05-17
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  0
  Scenarios completed: 104
  Requests completed:  104
  Mean response/sec: NaN
  Response time (msec):
    min: 60002.2
    max: 91548.3
    median: 60004.1
    p95: 63080.7
    p99: 76187.5
  Codes:
    504: 104

Report @ 14:03:59(-0300) 2020-05-17
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 140
  Requests completed:  140
  Mean response/sec: NaN
  Response time (msec):
    min: 60002.4
    max: 67147.2
    median: 60004.3
    p95: 63088.6
    p99: 67135.5
  Codes:
    504: 140

Report @ 14:04:09(-0300) 2020-05-17
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 102
  Requests completed:  102
  Mean response/sec: NaN
  Response time (msec):
    min: 60002.2
    max: 75346.4
    median: 60005.3
    p95: 70359.2
    p99: 75335.3
  Codes:
    504: 102

Report @ 14:04:19(-0300) 2020-05-17
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 41
  Requests completed:  41
  Mean response/sec: NaN
  Response time (msec):
    min: 60002.5
    max: 67149.3
    median: 61034.6
    p95: 67138
    p99: 67149.3
  Codes:
    504: 41

Started phase 4 (Non-linear Ramp), duration: 120s @ 14:04:19(-0300) 2020-05-17
Report @ 14:04:29(-0300) 2020-05-17
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  8
  Scenarios completed: 32
  Requests completed:  32
  Mean response/sec: 0.91
  Response time (msec):
    min: 63075.2
    max: 92024.7
    median: 75357.8
    p95: 92013.1
    p99: 92024.7
  Codes:
    504: 32

Report @ 14:04:39(-0300) 2020-05-17
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  8
  Scenarios completed: 19
  Requests completed:  19
  Mean response/sec: 0.87
  Response time (msec):
    min: 75350.3
    max: 91993.4
    median: 91823.4
    p95: 91981.9
    p99: 91993.4
  Codes:
    504: 19

Report @ 14:04:49(-0300) 2020-05-17
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  8
  Scenarios completed: 18
  Requests completed:  18
  Mean response/sec: 0.84
  Response time (msec):
    min: 91612.7
    max: 91973.4
    median: 91728.9
    p95: 91972.2
    p99: 91973.4
  Codes:
    504: 18

Report @ 14:04:59(-0300) 2020-05-17
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  9
  Scenarios completed: 8
  Requests completed:  8
  Mean response/sec: 0.9
  Response time (msec):
    min: 91681.7
    max: 92030.7
    median: 91961.8
    p95: 92030.7
    p99: 92030.7
  Codes:
    504: 8

Report @ 14:05:09(-0300) 2020-05-17
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  8
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 0.87
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 14:05:19(-0300) 2020-05-17
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  8
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 0.84
  Response time (msec):
    min: 54006.3
    max: 57316.4
    median: 55661.3
    p95: 57316.4
    p99: 57316.4
  Codes:
    200: 2

Report @ 14:05:29(-0300) 2020-05-17
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  9
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.9
  Response time (msec):
    min: 43349.9
    max: 56617.7
    median: 49985.4
    p95: 56268.3
    p99: 56617.7
  Codes:
    200: 20

Report @ 14:05:39(-0300) 2020-05-17
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  8
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.87
  Response time (msec):
    min: 29373.9
    max: 42651.2
    median: 36012.4
    p95: 42301.8
    p99: 42651.2
  Codes:
    200: 20

Report @ 14:05:49(-0300) 2020-05-17
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  8
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.84
  Response time (msec):
    min: 15399.2
    max: 28676.3
    median: 22038
    p95: 28326.6
    p99: 28676.3
  Codes:
    200: 20

Report @ 14:05:59(-0300) 2020-05-17
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  9
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.9
  Response time (msec):
    min: 1421.3
    max: 14699.5
    median: 8060.4
    p95: 14349.8
    p99: 14699.5
  Codes:
    200: 20

Report @ 14:06:09(-0300) 2020-05-17
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  8
  Scenarios completed: 9
  Requests completed:  9
  Mean response/sec: 0.87
  Response time (msec):
    min: 504.1
    max: 724.7
    median: 504.3
    p95: 724.7
    p99: 724.7
  Codes:
    200: 9

Report @ 14:06:19(-0300) 2020-05-17
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  8
  Scenarios completed: 8
  Requests completed:  8
  Mean response/sec: 0.84
  Response time (msec):
    min: 504.2
    max: 504.8
    median: 504.6
    p95: 504.8
    p99: 504.8
  Codes:
    200: 8

Started phase 5 (Non-linear Ramp 2), duration: 60s @ 14:06:19(-0300) 2020-05-17
Report @ 14:06:29(-0300) 2020-05-17
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  17
  Scenarios completed: 16
  Requests completed:  16
  Mean response/sec: 1.7
  Response time (msec):
    min: 504.2
    max: 506
    median: 504.7
    p95: 506
    p99: 506
  Codes:
    200: 16

Report @ 14:06:39(-0300) 2020-05-17
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  17
  Scenarios completed: 17
  Requests completed:  17
  Mean response/sec: 1.74
  Response time (msec):
    min: 504.1
    max: 507
    median: 504.8
    p95: 506.6
    p99: 507
  Codes:
    200: 17

Report @ 14:06:49(-0300) 2020-05-17
Elapsed time: 5 minutes, 50 seconds
  Scenarios launched:  16
  Scenarios completed: 17
  Requests completed:  17
  Mean response/sec: 1.67
  Response time (msec):
    min: 504.1
    max: 506.9
    median: 504.6
    p95: 506.6
    p99: 506.9
  Codes:
    200: 17

Report @ 14:06:59(-0300) 2020-05-17
Elapsed time: 6 minutes, 0 seconds
  Scenarios launched:  17
  Scenarios completed: 16
  Requests completed:  16
  Mean response/sec: 1.7
  Response time (msec):
    min: 504
    max: 505.3
    median: 504.7
    p95: 505.3
    p99: 505.3
  Codes:
    200: 16

Report @ 14:07:09(-0300) 2020-05-17
Elapsed time: 6 minutes, 10 seconds
  Scenarios launched:  17
  Scenarios completed: 17
  Requests completed:  17
  Mean response/sec: 1.74
  Response time (msec):
    min: 504
    max: 506.8
    median: 504.6
    p95: 506.1
    p99: 506.8
  Codes:
    200: 17

Report @ 14:07:19(-0300) 2020-05-17
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  16
  Scenarios completed: 17
  Requests completed:  17
  Mean response/sec: 1.67
  Response time (msec):
    min: 504.2
    max: 506.3
    median: 504.8
    p95: 506.2
    p99: 506.3
  Codes:
    200: 17

Started phase 6 (Active Pause), duration: 30s @ 14:07:19(-0300) 2020-05-17
Report @ 14:07:29(-0300) 2020-05-17
Elapsed time: 6 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 19
  Requests completed:  19
  Mean response/sec: 5.01
  Response time (msec):
    min: 504.2
    max: 5924.6
    median: 3213.4
    p95: 5788.8
    p99: 5924.6
  Codes:
    200: 19

Report @ 14:07:39(-0300) 2020-05-17
Elapsed time: 6 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5.01
  Response time (msec):
    min: 6225.8
    max: 11950.1
    median: 9090.6
    p95: 11799.6
    p99: 11950.1
  Codes:
    200: 20

Report @ 14:07:49(-0300) 2020-05-17
Elapsed time: 6 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5.01
  Response time (msec):
    min: 12251.1
    max: 17971.7
    median: 15111
    p95: 17821
    p99: 17971.7
  Codes:
    200: 20

Started phase 7 (Non-linear Ramp 3), duration: 30s @ 14:07:49(-0300) 2020-05-17
Report @ 14:07:59(-0300) 2020-05-17
Elapsed time: 7 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5.01
  Response time (msec):
    min: 18273.2
    max: 23997.4
    median: 21135.7
    p95: 23847.1
    p99: 23997.4
  Codes:
    200: 20

Report @ 14:08:09(-0300) 2020-05-17
Elapsed time: 7 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5.01
  Response time (msec):
    min: 24298.3
    max: 30022.8
    median: 27159.8
    p95: 29871.7
    p99: 30022.8
  Codes:
    200: 20

Report @ 14:08:19(-0300) 2020-05-17
Elapsed time: 7 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5.01
  Response time (msec):
    min: 30324.3
    max: 36052.7
    median: 33188.4
    p95: 35902
    p99: 36052.7
  Codes:
    200: 20

Report @ 14:08:29(-0300) 2020-05-17
Elapsed time: 7 minutes, 30 seconds
  Scenarios launched:  1
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.1
  Response time (msec):
    min: 36353.9
    max: 42081.5
    median: 39217.3
    p95: 41930.7
    p99: 42081.5
  Codes:
    200: 20

Report @ 14:08:39(-0300) 2020-05-17
Elapsed time: 7 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 42382.7
    max: 48105
    median: 45243
    p95: 47954.2
    p99: 48105
  Codes:
    200: 20

Report @ 14:08:49(-0300) 2020-05-17
Elapsed time: 7 minutes, 50 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 48406
    max: 54125
    median: 51265
    p95: 53974.3
    p99: 54125
  Codes:
    200: 20

Report @ 14:08:59(-0300) 2020-05-17
Elapsed time: 8 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 21
  Requests completed:  21
  Mean response/sec: NaN
  Response time (msec):
    min: 54425.3
    max: 60004.5
    median: 57436.1
    p95: 60003.8
    p99: 60004.5
  Codes:
    200: 19
    504: 2

Report @ 14:09:09(-0300) 2020-05-17
Elapsed time: 8 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 29
  Requests completed:  29
  Mean response/sec: NaN
  Response time (msec):
    min: 60003
    max: 61063.1
    median: 60004.2
    p95: 61055.8
    p99: 61063.1
  Codes:
    504: 29

Report @ 14:09:19(-0300) 2020-05-17
Elapsed time: 8 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 23
  Requests completed:  23
  Mean response/sec: NaN
  Response time (msec):
    min: 60002.3
    max: 67151.6
    median: 60004.7
    p95: 67145.9
    p99: 67151.6
  Codes:
    504: 23

Report @ 14:09:29(-0300) 2020-05-17
Elapsed time: 8 minutes, 30 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 63088.6
    max: 75656.3
    median: 67127.6
    p95: 75644.3
    p99: 75656.3
  Codes:
    504: 20

Report @ 14:09:39(-0300) 2020-05-17
Elapsed time: 8 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 75191
    max: 92024.3
    median: 91572.8
    p95: 92004.5
    p99: 92024.3
  Codes:
    504: 20

Report @ 14:09:46(-0300) 2020-05-17
Elapsed time: 8 minutes, 47 seconds
  Scenarios launched:  0
  Scenarios completed: 9
  Requests completed:  9
  Mean response/sec: NaN
  Response time (msec):
    min: 91551.2
    max: 92032.1
    median: 91655.4
    p95: 92032.1
    p99: 92032.1
  Codes:
    504: 9

All virtual users finished
Summary report @ 14:09:46(-0300) 2020-05-17
  Scenarios launched:  4345
  Scenarios completed: 1697
  Requests completed:  1697
  Mean response/sec: 8.25
  Response time (msec):
    min: 504
    max: 92032.1
    median: 60004.3
    p95: 91582
    p99: 91972.9
  Scenario counts:
    intensivo: 4345 (100%)
  Codes:
    200: 593
    502: 22
    504: 1082
  Errors:
    ECONNRESET: 2648